{
    "actor": [
        {
            "name": "Christian Bale",
            "birthname":"Christian Charles Philip Bale",
            "birth": "January 30, 1974",
            "placebirth":"Haverfordwest, Pembrokeshire, Wales, UK",
            "height": "1.83 m",
            "cast": "Bruce Wayne",
            "photo": "https://bit.ly/3CymmPA",
            "minibio": "Christian Charles Philip Bale was born in Pembrokeshire, Wales, UK on January 30, 1974, to English parents Jennifer Jenny (James) and David Bale. His mother was a circus performer and his father, who was born in South Africa, was a commercial pilot. The family lived in different countries throughout Bale's childhood, including England, Portugal, and the United States. Bale acknowledges the constant change was one of the influences on his career choice."
        },
        {
            "name": "Heath Ledger",
            "birthname":"Heath Ledger",
            "birth": "April 4, 1979",
            "placebirth":"Perth, Western Australia, Australia",
            "height": "1.85 m",
            "cast": "Joker",
            "photo": "https://bit.ly/3CukHdz",
            "minibio": "Heath Ledger was born on the fourth of April 1979, in Perth, Western Australia, to Sally (Ramshaw), a teacher of French, and Kim Ledger, a mining engineer who also raced cars. His ancestry was Scottish, English, Irish, and Sephardi Jewish. As the story goes, in junior high school it was compulsory to take one of two electives, either cooking or drama. As Heath could not see himself in a cooking class he tried his hand at drama. Heath was talented, however the rest of the class did not acknowledge his talent. When he was seventeen he and a friend decided to pack up, leave school, take a car and rough it to Sydney. Heath believed Sydney to be the place where dreams were made or, at least, where actors could possibly get their big break. Upon arriving in Sydney with a purported sixty-nine cents to his name, Heath tried everything to get a break."
        },
        {
            "name": "Aaron Eckhart",
            "birthname":"Aaron Edward Eckhart",
            "birth": "March 12, 1968",
            "placebirth": "Cupertino, California, USA",
            "height": "1.8 m",
            "cast": "Harvey Dent",
            "photo": "https://bit.ly/3kVrGGJ",
            "minibio": "Aaron Eckhart was born on March 12, 1968 in Cupertino, California, USA as Aaron Edward Eckhart. He is an actor and producer, known for The Dark Knight (2008), Thank You for Smoking (2005) and Rabbit Hole (2010)."
        },
        {
            "name": "Maggie Gyllenhaal",
            "birthname":"Margaret Ruth Gyllenhaal",
            "birth": "November 16, 1977",
            "placebirth":"Lower East Side, Manhattan, New York City, New York, USA",
            "height": "1.75 m",
            "cast": "Rachel",
            "photo": "https://bit.ly/3x1l920",
            "minibio": "Academy Award-nominated actress Maggie Gyllenhaal was born on November 16, 1977, on the Lower East Side of Manhattan in New York City. Her parents, Naomi Foner (née Achs) and Stephen Gyllenhaal, are both filmmakers, and her brother is actor Jake Gyllenhaal. Her mother is from an Ashkenazi Jewish family, while her father has Swedish, English, Swiss-German, and German ancestry."
        },
        {
            "name": "Morgan Freeman",
            "birthname":"Morgan Freeman",
            "birth": "June 1, 1937",
            "placebirth":"Memphis, Tennessee, USA",
            "height": "",
            "cast": "Lucius Fox",
            "photo": "https://bit.ly/3r1NiEW",
            "minibio": "With an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born on June 1, 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended Los Angeles City College before serving several years in the US Air Force as a mechanic between 1955 and 1959. His first dramatic arts exposure was on the stage including appearing in an all-African American production of the exuberant musical Hello, Dolly!."
        },
        {
            "name": "Ron Dean",
            "birthname":"Ronald Charles Dean",
            "birth": "August 15, 1938",
            "placebirth": "Chicago, Illinois, USA",
            "height": "1.75 m",
            "cast": "Wuertz",
            "photo": "https://bit.ly/30C482e",
            "minibio": "Ron Dean is a character actor with over thirty years of film and television roles to his credit. This multi-talented actor, with a (tough guy) demeanor, has masterfully played nasty villains to hard, authoritative individuals (often as cops and military officials). Ron Dean has played in several notable films with many of Hollywood's biggest names in the business. Roles include notable '90s films The Fugitive (1993) starring Harrison Ford and Tommy Lee Jones and next in The Client (1994), again starring Tommy Lee Jones."
        },
        {
            "name": "Chin Han",
            "birthname":"Chin-han Ng",
            "birth": "November 27, 1969",
            "placebirth": "Singapore",
            "height": "1.75 m",
            "cast": "Lau",
            "photo": "https://bit.ly/3CCJfkN",
            "minibio": "Named one of Asia's 25 greatest actors of all-time by CNNGo (a division of CNN) alongside stars like Japan's Toshiro Mifune and India's Amitabh Bachchan and nominated for Variety's Asian Star of the Year Award in 2013, Chin Han's 20 year career has spanned many international theater, television and film projects."
        },
        {
            "name": "Michael Caine",
            "birthname":"Maurice Joseph Micklewhite",
            "birth": "March 14, 1933",
            "placebirth": "Rotherhithe, London, England, UK",
            "height": "1.88 m",
            "cast": "Alfred",
            "photo": "https://bit.ly/3kSCFR4",
            "minibio": "Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at age 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England, he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed, he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit (The Long and the Short and the Tall)."
        },
        {
            "name": "Gary Oldman",
            "birthname":"Gary Leonard Oldman",
            "birth": "March 21, 1958",
            "placebirth": "New Cross, London, England, UK",
            "height": "1.74 m",
            "cast": "Gordon",
            "photo": "https://bit.ly/3kSQA9T",
            "minibio": "Gary Oldman is a talented English movie star and character actor, renowned for his expressive acting style. One of the most celebrated thespians of his generation, with a diverse career encompassing theatre, film and television, he is known for his roles as Sid Vicious in Sid and Nancy (1986), Drexl in True Romance (1993), George Smiley in Tinker Tailor Soldier Spy (2011), and Winston Churchill in Darkest Hour (2017), among many others. For much of his career, he was best-known for playing over-the-top antagonists, such as terrorist Egor Korshunov in the 1997 blockbuster Air Force One (1997), though he has reached a new audience with heroic roles in the Harry Potter and Dark Knight franchises. He is also a filmmaker, musician, and author."
        },
        {
            "name": "Monique Gabriela Curnen",
            "birthname":"Monique Gabriela Curnen",
            "birth": "September 7, 1970",
            "placebirth": "USA",
            "height": "1.7 m",
            "cast": "Ramirez",
            "photo": "https://bit.ly/3CzDkNw",
            "minibio": "Monique Gabriela Curnen is an American actress who has worked in theater, film and television. She grew up in Massachusetts. Both parents were educators and encouraged creativity in the home. Monique took an interest in acting after watching her older brother perform in a school orchestra, and soon began performing in school plays."
        }
    ]
}